java -jar FTPhelper.jar "C:\Users\jeave\Desktop\TEM 1400_20190921_周二_1430-1730_王林格_杨瑾仪(初).xlsx" "booking" "20190909-20190913" "TEM-1400" "2_1430-1730" "TEM 1400_20190921_周二_1430-1730_王林格_杨瑾仪(初).xlsx"
pause

::##########################################[Author: Jeaven Wong]###################################################################################

::具体的参数根据需求改变，直接改上面未注释部分的参数值即可。
::java -jar FTPhelper.jar param1 param2 param3 param4 param5 param6
::参数含义如下：
::param1 --- 本地待上传的文件的绝对路径，例如: "C:\Users\jeave\Desktop\TEM 1400_20190921_周二_1430-1730_王林格_杨瑾仪(初).xlsx"
::param2 --- FTP服务器根目录下的存储路径的第一级文件夹，比如: "booking"
::param3 --- FTP服务器根目录下的存储路径的第二级文件夹，比如: "20190909-20190913"
::param4 --- FTP服务器根目录下的存储路径的第三级文件夹，比如: "TEM-1400"
::param5 --- FTP服务器根目录下的存储路径的第四级文件夹，比如: "2_1430-1730"
::param6 --- FTP服务器要存放的文件的名字（带后缀），比如: "TEM 1400_20190921_周二_1430-1730_王林格_杨瑾仪(初).xlsx"

::注意： 
::一、各个参数的值用""括起来
::二、各个参数之间记得间隔一个空格
::三、当运行后出现了"SUCCESS"和运行时间后则说明程序运行成功。否则还在运行中，如果没有提示错误请勿关闭。

::#########################################[Author: Jeaven Wong]################################################################################